app/controllers/tweetsandwiches_controller.rb

  def index
    @tweetsandwiches = Tweetsandwich.limit(42).order('id desc')
---
SELECT "tweetsandwiches".* FROM "tweetsandwiches" ORDER BY id desc LIMIT 42

  def show
    @tweetsandwich = Tweetsandwich.find(params[:id])
---
SELECT "tweetsandwiches".* FROM "tweetsandwiches" WHERE "tweetsandwiches"."id" = ? LIMIT 1  [["id", "show"]]